Documents/ПланРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ПланРабот</Name>
			<BasedOn>
				<xr:Item>Catalog.ЗадачиПроектов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
				<xr:Item>AccumulationRegister.ФронтРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокПоСмете</Name>
					<Comment>Разница между суммой по смете и суммой плана работ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезКоэффициентовФОТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФронтРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Comment>Первый день месяца</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяСтавка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/БюджетПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетПоМесяцам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Comment>Факт облагается РКО</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПланаБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСуммыБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ТабельРаботПоЗадачеПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ТабельРаботПоЗадачеПроекта</Name>
			<BasedOn>
				<xr:Item>Catalog.ЗадачиПроектов</xr:Item>
				<xr:Item>Document.ПланРабот</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗакрытиеПлановРабот</xr:Item>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
				<xr:Item>AccumulationRegister.ФронтРабот</xr:Item>
				<xr:Item>AccumulationRegister.ФондПодразделений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРабот</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗакрытия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочееВремя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяСтавка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаТабеля</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектовСтруктура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Закрыто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПланРабот/Ext/ManagerModule.bsl
//*****************************************************************
// формирует структуру для плана работ, который содержится в смете
// если сметы задачи проекта, в которую включен План работ нет, то возвращается неопределено
// 
Функция СуммаПланаРаботПоСметеЗадачиПроекта( ЗадачаПроекта ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(БюджетПоМесяцамОбороты.Месяц, ДАТАВРЕМЯ(1, 1, 1))) КАК Месяц,
		|	СУММА(ЕСТЬNULL(БюджетПоМесяцамОбороты.СуммаОборот, 0)) КАК Сумма
		|ИЗ
		|	РегистрНакопления.БюджетПоМесяцам.Обороты КАК БюджетПоМесяцамОбороты
		|ГДЕ
		|	БюджетПоМесяцамОбороты.СтатьяСметы 		= &СтатьяФОТПП
		|	И БюджетПоМесяцамОбороты.ЗадачаПроекта 	= &ЗадачаПроекта
		|	И БюджетПоМесяцамОбороты.ТипСуммы 		= ЗНАЧЕНИЕ(Перечисление.ТипСуммыБюджета.Факт)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(БюджетПоМесяцам.Сумма) КАК Сумма,
		|	БюджетПоМесяцам.Регистратор КАК СметаЗадачиПроекта
		|ИЗ
		|	РегистрНакопления.БюджетПоМесяцам КАК БюджетПоМесяцам
		|ГДЕ
		|	БюджетПоМесяцам.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипСуммыБюджета.План)
		|	И БюджетПоМесяцам.ЗадачаПроекта = &ЗадачаПроекта
		|	И БюджетПоМесяцам.СтатьяСметы = &СтатьяФОТПП
		|
		|СГРУППИРОВАТЬ ПО
		|	БюджетПоМесяцам.Регистратор";

		
	// закрыто
	Запрос.УстановитьПараметр("СтатьяФОТПП", 	Справочники.СтатьиСметы.ФОТ_ПП );
	Запрос.УстановитьПараметр("ЗадачаПроекта",  ЗадачаПроекта );
	// 
	МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	тзЗакрыто = МассивРезультатовЗапроса[0].Выгрузить();
	тзСмета   = МассивРезультатовЗапроса[1].Выгрузить();
	
	сРезультат = Новый Структура;
	// нет сметы задачи, включающей план работ
	Если тзСмета.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// план по смете
	сРезультат.Вставить("СуммаПлан", 			тзСмета[0].Сумма);
	сРезультат.Вставить("СметаЗадачиПроекта", 	тзСмета[0].СметаЗадачиПроекта);
	
	Если ЗначениеЗаполнено( тзЗакрыто[0].Месяц) Тогда
		сРезультат.Вставить("Месяц", 		тзЗакрыто[0].Месяц);
		сРезультат.Вставить("СуммаЗакрыто", тзЗакрыто[0].Сумма);
	Иначе
		сРезультат.Вставить("Месяц", 		Дата(1,1,1));
		сРезультат.Вставить("СуммаЗакрыто", 0);
	КонецЕсли;
	Возврат сРезультат;	
	
КонецФункции

Функция ЗакрытиеПланаРабот( ПланРабот )   Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(БюджетПоМесяцам.Месяц, ДАТАВРЕМЯ(1, 1, 1))) КАК Месяц,
		|	СУММА(ЕСТЬNULL(БюджетПоМесяцам.Сумма, 0)) КАК Сумма
		|ИЗ
		|	РегистрНакопления.БюджетПоМесяцам КАК БюджетПоМесяцам
		|ГДЕ
		|	БюджетПоМесяцам.СтатьяСметы = &СтатьяФОТПП
		|	И БюджетПоМесяцам.ЗадачаПроекта = &ЗадачаПроекта
		|	И БюджетПоМесяцам.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипСуммыБюджета.Факт)
		|	И ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(БюджетПоМесяцам.Регистратор) = ТИП(Документ.ТабельРаботПоЗадачеПроекта)
		|				ТОГДА БюджетПоМесяцам.Регистратор.ПланРабот = &ПланРабот
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	БюджетПоМесяцам.ЗадачаПроекта";

		
	// закрыто
	Запрос.УстановитьПараметр("СтатьяФОТПП", 	Справочники.СтатьиСметы.ФОТ_ПП );
	Запрос.УстановитьПараметр("ПланРабот",  	ПланРабот );
	Запрос.УстановитьПараметр("ЗадачаПроекта",  ПланРабот.ЗадачаПроекта );
	
	сРезультат 				= Новый Структура;
	// 
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		сРезультат.Вставить("Месяц", 		ВыборкаДетальныеЗаписи.Месяц);
		сРезультат.Вставить("СуммаЗакрыто", ВыборкаДетальныеЗаписи.Сумма);
		Возврат сРезультат;
	КонецЦикла;
	сРезультат.Вставить("Месяц", 		Дата(1,1,1));
	сРезультат.Вставить("СуммаЗакрыто", 0);
	Возврат сРезультат;
	
	
КонецФункции


Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	// печать счёта на оплату
	ПодготовитьПечатнуюФорму(
		"ПланРабот",
		НСтр("ru = 'План работ'"),
		"ОбщиеМакеты.ПФ_MXL_ПланРабот",
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода);
	
		
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Ложь;
	
	
КонецПроцедуры

Процедура ПодготовитьПечатнуюФорму(Знач ИмяМакета, ПредставлениеМакета, ПолныйПутьКМакету = "", МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета);
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ПредставлениеМакета,
			УП_ПланыРаботПоПроектам.ПечатьПланаРабот(МассивОбъектов, ОбъектыПечати, ИмяМакета),
			,
			ПолныйПутьКМакету);
	КонецЕсли;
	
	
КонецПроцедуры
